In [1]:
import pandas as pd

In [2]:
import numpy as np

### Data series - Numpy array,Dictionaries

In [3]:
a = ["ece","cse","eee","civil"]
data = pd.Series(a)
data

0      ece
1      cse
2      eee
3    civil
dtype: object

In [4]:
b = np.array([1,2,3,4])
d = pd.Series(b)
d

0    1
1    2
2    3
3    4
dtype: int32

In [13]:
di = {"ece":5,"eee":3,"cse":2}
d1 = pd.Series(di)
d1

ece    5
eee    3
cse    2
dtype: int64

### Data Frame - Numpy array,Dictionaries

In [11]:
data = [1,2,3]
data = pd.DataFrame(data,columns = ["number"],index = ["a","b","c"])
data

   number
a       1
b       2
c       3

In [43]:
d = {"tejaswini":["ece",21,"401"],"prasuna":["eee",21,509],"singam":["cse",22,309],"anusha":["cse",21,201]}
data = pd.DataFrame(d)
data

  tejaswini prasuna singam anusha
0       ece     eee    cse    cse
1        21      21     22     21
2       401     509    309    201

In [53]:
dat= pd.DataFrame(data,index=range(0,3))

In [54]:
dat

  tejaswini prasuna singam anusha
0       ece     eee    cse    cse
1        21      21     22     21
2       401     509    309    201

### Getting index,values

In [55]:
dat.index

RangeIndex(start=0, stop=3, step=1)

In [56]:
dat.values

array([['ece', 'eee', 'cse', 'cse'],
       [21, 21, 22, 21],
       ['401', 509, 309, 201]], dtype=object)

In [57]:
dat["tejaswini"]

0    ece
1     21
2    401
Name: tejaswini, dtype: object

In [59]:
dat["tejaswini"][0]

'ece'

In [66]:
dat[["tejaswini","prasuna","singam"]]

  tejaswini prasuna singam
0       ece     eee    cse
1        21      21     22
2       401     509    309

### Using NumPy functions : using masking, mathematics

In [69]:
d = {'a':[0.2,0.9,1,2,3],"b":[0.7,1,2,3,4]}
data = pd.DataFrame(d)
data

     a    b
0  0.2  0.7
1  0.9  1.0
2  1.0  2.0
3  2.0  3.0
4  3.0  4.0

In [74]:
[data>1]

[       a      b
 0  False  False
 1  False  False
 2  False   True
 3   True   True
 4   True   True]

In [77]:
s = data[data>1]
s

     a    b
0  NaN  NaN
1  NaN  NaN
2  NaN  2.0
3  2.0  3.0
4  3.0  4.0

### isnull, notnull

In [76]:
data.isnull()

       a      b
0  False  False
1  False  False
2  False  False
3  False  False
4  False  False

In [78]:
s.isnull()

       a      b
0   True   True
1   True   True
2   True  False
3  False  False
4  False  False

In [79]:
s.notnull()

       a      b
0  False  False
1  False  False
2  False   True
3   True   True
4   True   True

In [80]:
pd.notnull(s)

       a      b
0  False  False
1  False  False
2  False   True
3   True   True
4   True   True

### count of missing values

In [81]:
s.isnull().sum()

a    3
b    2
dtype: int64

In [83]:
data[data>1].count()

a    2
b    3
dtype: int64

### head(), sample(),tail()

In [84]:
data

     a    b
0  0.2  0.7
1  0.9  1.0
2  1.0  2.0
3  2.0  3.0
4  3.0  4.0

In [85]:
data.head(2)

     a    b
0  0.2  0.7
1  0.9  1.0

In [87]:
data.tail(3)

     a    b
2  1.0  2.0
3  2.0  3.0
4  3.0  4.0

In [88]:
data.sample(2)

     a    b
2  1.0  2.0
4  3.0  4.0

### creating columns and index values

In [89]:
data

     a    b
0  0.2  0.7
1  0.9  1.0
2  1.0  2.0
3  2.0  3.0
4  3.0  4.0

In [92]:
data["c"]=[1,2,3,45,np.nan]
data

     a    b     c
0  0.2  0.7   1.0
1  0.9  1.0   2.0
2  1.0  2.0   3.0
3  2.0  3.0  45.0
4  3.0  4.0   NaN

In [99]:
data = data.drop(["a"],axis=1)

In [100]:
data

     b     c
0  0.7   1.0
1  1.0   2.0
2  2.0   3.0
3  3.0  45.0
4  4.0   NaN

### Reindexing

In [102]:
data = data.reindex(["ece","eee","cse","civil","mech"])
data

        b   c
ece   NaN NaN
eee   NaN NaN
cse   NaN NaN
civil NaN NaN
mech  NaN NaN

### Selection with loc and iloc

- Selection with loc and iloc
For DataFrame label-indexing on the rows, the special indexing operators loc and iloc enable you to select a subset of the rows and columns from a DataFrame .The difference between them is loc gets rows (or columns) with particular labels from the index,iloc gets rows (or columns)at particular positions in the index(though it takes only integers

        b   c
ece   NaN NaN
eee   NaN NaN
cse   NaN NaN
civil NaN NaN
mech  NaN NaN

In [107]:
d = {"tejaswini":["ece",21,"401"],"prasuna":["eee",21,509],"singam":["cse",22,309],"anusha":["cse",21,201]}
data = pd.DataFrame(d)
data

  tejaswini prasuna singam anusha
0       ece     eee    cse    cse
1        21      21     22     21
2       401     509    309    201

In [108]:
d = {"tej":["ece",21,"401"],"prasuna":["eee",21,509],"singam":["cse",22,309],"anusha":["cse",21,201]}
data1 = pd.DataFrame(d)
data1

   tej prasuna singam anusha
0  ece     eee    cse    cse
1   21      21     22     21
2  401     509    309    201

In [109]:
data+data1

   anusha prasuna  singam  tej tejaswini
0  csecse  eeeeee  csecse  NaN       NaN
1      42      42      44  NaN       NaN
2     402    1018     618  NaN       NaN